Финансы / Состояние

Цель - отслеживать состояния финансов, включая не только деньги, но и
  другие ценности, продажа которых возможна (входят - ценное имущество, электроника,
  не входят - одежда, еда, интвестиции в красоту, знания, умения)

Сущности
  Деньги
    Счета
      Аккаунт (валюта, баланс, банк, название)
      Наличные
  Ценные Бумаги
  Вещи

Account [ name currency balance ]
Active [ name ]

приход/расход
  категории
  теги

продажа/покупка ценностей

Как посетитель, я хочу зарегестрироваться использую аккаунт гугл или фб.
Как пользователь, я хочу
    добавить несколько аккаунтов в разных валютах.
    добавить наличные в нескольких валютах.
    добавить ценные бумаги.
    добавить имущество, по его текущим ценам.
При добавлении имущества, я хочу добавить параметры его удешевления со временем.

Я хочу знать стоимость своих активов в разных валютах, золоте, либо других обменных товарах.



